In [9]:
import pandas

In [15]:
df1=pandas.read_json("supermarkets.json")
df1

,Address,City,Country,Employees,ID,Name,State
0,3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
1,735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
2,332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3,3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
4,1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
5,551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [19]:
df1.loc[1:3,"City":"Name"]

            City Country  Employees  ID         Name
1  San Francisco     USA         15   2  Bready Shop
2  San Francisco     USA         25   3  Super River
3  San Francisco     USA         10   4   Ben's Shop

In [20]:
df1.loc["1":"3","City":"Name"]

            City Country  Employees  ID         Name
1  San Francisco     USA         15   2  Bready Shop
2  San Francisco     USA         25   3  Super River
3  San Francisco     USA         10   4   Ben's Shop

In [16]:
df1.loc[3,"Name"]

"Ben's Shop"

In [19]:
df1.loc[:,"Name"]

0        Madeira
1    Bready Shop
2    Super River
3     Ben's Shop
4        Sanchez
5     Richvalley
Name: Name, dtype: object

In [38]:
df1.iloc[1:4,2:5]

  Country  Employees  ID
1     USA         15   2
2     USA         25   3
3     USA         10   4

In [17]:
df1.iloc[2,0:4]

Address        332 Hill St
City         San Francisco
Country                USA
Employees               25
Name: 2, dtype: object

In [18]:
type(df1)

pandas.core.frame.DataFrame